In [3]:
# Импортируем необходимые библиотеки
import numpy as np
import pandas as pd

## Загрузка и базовый осмотр

* Titanic Huge Dataset - 1M Passengersc: https://www.kaggle.com/datasets/marcpaulo/titanic-huge-dataset-1m-passengers

скачиваем файл `huge_1M_titanic.csv` и кладем в удобное место

In [2]:
path2frame = "./data/huge_1M_titanic.csv"
# Считываем датасет
frame = pd.read_csv(path2frame) 

# Смотрим размер датасета (кол-во строк, кол-во столбцов)
print(frame.shape)

(1000000, 12)

In [5]:
# Посмотреть информацию о датасете
frame.info()

<class 'pandas.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 12 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   PassengerId  1000000 non-null  int64
 1   Survived     1000000 non-null  int64
 2   Pclass       1000000 non-null  int64
 3   Name         1000000 non-null  str
 4   Sex          1000000 non-null  str
 5   Age          801400 non-null   float64
 6   SibSp        1000000 non-null  int64
 7   Parch        1000000 non-null  int64
 8   Ticket       1000000 non-null  str
 9   Fare         1000000 non-null  float64
 10  Cabin        229805 non-null   str
 11  Embarked     997760 non-null   str
dtypes: float64(2), int64(5), str(5)
memory usage: 91.6 MB

In [6]:
# Определить пропуски в каждом из столбцов
frame.isna().sum()

PassengerId         0
Survived            0
Pclass              0
Name                0
Sex                 0
Age            198600
SibSp               0
Parch               0
Ticket              0
Fare                0
Cabin          770195
Embarked         2240
dtype: int64

In [7]:
# Посмотреть первые 5 строк датасета
frame.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1310,1,1,"Name1310, Miss. Surname1310",female,NaN,0,0,SOTON/O2 3101272,76.760165,NaN,C
1,1311,0,3,"Name1311, Col. Surname1311",male,29.0,0,0,223596,10.193097,NaN,S
2,1312,0,3,"Name1312, Mr. Surname1312",male,20.0,0,0,54636,12.029416,C83,C
3,1313,0,3,"Name1313, Mr. Surname1313",male,27.0,0,0,PC 17760,13.429448,NaN,S
4,1314,0,3,"Name1314, Mr. Surname1314",male,32.0,0,0,364512,4.840769,E33,C

In [8]:
# Можно посмотреть названия колонок
frame.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='str')

In [23]:
# Обращение к строке датафейма по index (вернет pandas.Series)
frame.iloc[0]

PassengerId                           1310
Survived                                 1
Pclass                                   1
Name           Name1310, Miss. Surname1310
Sex                                 female
Age                                   29.0
SibSp                                    0
Parch                                    0
Ticket                    SOTON/O2 3101272
Fare                             76.760165
Embarked                                 C
Name: 0, dtype: object

In [26]:
# Обращение к конкретной ячейке
frame.loc[0, 'PassengerId']

np.int64(1310)

In [31]:
# К столбцам можно обращаться как к полям объекта (вернет pandas.Series)
frame.Age

0         29.0
1         29.0
2         20.0
3         27.0
4         32.0
          ...
999995    27.0
999996    33.0
999997    29.0
999998    35.0
999999    37.0
Name: Age, Length: 1000000, dtype: float64

In [32]:
# Или так
frame["Age"]

0         29.0
1         29.0
2         20.0
3         27.0
4         32.0
          ...
999995    27.0
999996    33.0
999997    29.0
999998    35.0
999999    37.0
Name: Age, Length: 1000000, dtype: float64

In [33]:
frame["Age"][0]

np.float64(29.0)

In [9]:
# Можно определить тип колонки 
frame['Survived'].dtype

dtype('int64')

In [42]:
# Можно делать специфические выборки, по индексам (например, взять 3 первые строки и 4 первые столбца)
frame.iloc[:3, :4]

   PassengerId  Survived  Pclass                         Name
0         1310         1       1  Name1310, Miss. Surname1310
1         1311         0       3   Name1311, Col. Surname1311
2         1312         0       3    Name1312, Mr. Surname1312

In [45]:
# Или вот
frame.iloc[2:7, 2:6]

   Pclass                           Name     Sex   Age
2       3      Name1312, Mr. Surname1312    male  20.0
3       3      Name1313, Mr. Surname1313    male  27.0
4       3      Name1314, Mr. Surname1314    male  32.0
5       3  Name1315, Master. Surname1315  female   0.0
6       1      Name1316, Mr. Surname1316    male  29.0

In [46]:
# Выбор строк по условию
frame[frame['Pclass'] == 3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
1,1311,0,3,"Name1311, Col. Surname1311",male,29.0,0,0,223596,10.193097,S
2,1312,0,3,"Name1312, Mr. Surname1312",male,20.0,0,0,54636,12.029416,C
3,1313,0,3,"Name1313, Mr. Surname1313",male,27.0,0,0,PC 17760,13.429448,S
4,1314,0,3,"Name1314, Mr. Surname1314",male,32.0,0,0,364512,4.840769,C
5,1315,1,3,"Name1315, Master. Surname1315",female,0.0,0,0,29750,14.805817,S
...,...,...,...,...,...,...,...,...,...,...,...
999987,1001297,0,3,"Name1001297, Dr. Surname1001297",male,17.0,0,0,A/5. 10482,9.178315,C
999990,1001300,1,3,"Name1001300, Master. Surname1001300",female,7.0,1,1,330931,2.725446,S
999993,1001303,1,3,"Name1001303, Mr. Surname1001303",male,23.0,0,0,CA 2144,17.041989,S
999994,1001304,0,3,"Name1001304, Mr. Surname1001304",male,19.0,0,0,330909,10.193855,S
999997,1001307,0,3,"Name1001307, Mr. Surname1001307",male,29.0,1,0,PC 17601,8.274807,S

In [48]:
frame[frame.Pclass == 3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
1,1311,0,3,"Name1311, Col. Surname1311",male,29.0,0,0,223596,10.193097,S
2,1312,0,3,"Name1312, Mr. Surname1312",male,20.0,0,0,54636,12.029416,C
3,1313,0,3,"Name1313, Mr. Surname1313",male,27.0,0,0,PC 17760,13.429448,S
4,1314,0,3,"Name1314, Mr. Surname1314",male,32.0,0,0,364512,4.840769,C
5,1315,1,3,"Name1315, Master. Surname1315",female,0.0,0,0,29750,14.805817,S
...,...,...,...,...,...,...,...,...,...,...,...
999987,1001297,0,3,"Name1001297, Dr. Surname1001297",male,17.0,0,0,A/5. 10482,9.178315,C
999990,1001300,1,3,"Name1001300, Master. Surname1001300",female,7.0,1,1,330931,2.725446,S
999993,1001303,1,3,"Name1001303, Mr. Surname1001303",male,23.0,0,0,CA 2144,17.041989,S
999994,1001304,0,3,"Name1001304, Mr. Surname1001304",male,19.0,0,0,330909,10.193855,S
999997,1001307,0,3,"Name1001307, Mr. Surname1001307",male,29.0,1,0,PC 17601,8.274807,S

In [49]:
# Множественное условие (& - и, выполнение всех условий)
frame.loc[(frame.Pclass == 3) & (frame.Age >= 29)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
1,1311,0,3,"Name1311, Col. Surname1311",male,29.0,0,0,223596,10.193097,S
4,1314,0,3,"Name1314, Mr. Surname1314",male,32.0,0,0,364512,4.840769,C
11,1321,0,3,"Name1321, Mr. Surname1321",male,29.0,0,0,2689,4.797827,C
12,1322,1,3,"Name1322, Miss. Surname1322",female,29.0,1,0,S.O./P.P. 3,12.462809,S
14,1324,0,3,"Name1324, Mr. Surname1324",male,46.0,0,0,239854,0.000000,S
...,...,...,...,...,...,...,...,...,...,...,...
999973,1001283,1,3,"Name1001283, Miss. Surname1001283",female,29.0,0,0,350042,8.859394,Q
999976,1001286,0,3,"Name1001286, Mr. Surname1001286",male,29.0,0,0,4579,12.832482,S
999977,1001287,1,3,"Name1001287, Mr. Surname1001287",male,29.0,0,0,4133,28.757433,S
999986,1001296,0,3,"Name1001296, Miss. Surname1001296",female,36.0,1,6,365226,35.706551,C
999997,1001307,0,3,"Name1001307, Mr. Surname1001307",male,29.0,1,0,PC 17601,8.274807,S

In [ ]:
# (| - и, выполнение хотя бы одного из условий)
# Можно заметить, что получили больше сток в выборке
frame.loc[(frame.Pclass == 3) | (frame.Age >= 29)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1310,1,1,"Name1310, Miss. Surname1310",female,29.0,0,0,SOTON/O2 3101272,76.760165,C
1,1311,0,3,"Name1311, Col. Surname1311",male,29.0,0,0,223596,10.193097,S
2,1312,0,3,"Name1312, Mr. Surname1312",male,20.0,0,0,54636,12.029416,C
3,1313,0,3,"Name1313, Mr. Surname1313",male,27.0,0,0,PC 17760,13.429448,S
4,1314,0,3,"Name1314, Mr. Surname1314",male,32.0,0,0,364512,4.840769,C
...,...,...,...,...,...,...,...,...,...,...,...
999994,1001304,0,3,"Name1001304, Mr. Surname1001304",male,19.0,0,0,330909,10.193855,S
999996,1001306,1,1,"Name1001306, Miss. Surname1001306",female,33.0,0,0,349221,102.555248,S
999997,1001307,0,3,"Name1001307, Mr. Surname1001307",male,29.0,1,0,PC 17601,8.274807,S
999998,1001308,0,2,"Name1001308, Mr. Surname1001308",male,35.0,1,0,112050,0.000000,S
999999,1001309,1,1,"Name1001309, Miss. Surname1001309",female,37.0,1,0,28403,57.720316,S

In [54]:
frame.Age.notnull()

0         True
1         True
2         True
3         True
4         True
          ...
999995    True
999996    True
999997    True
999998    True
999999    True
Name: Age, Length: 1000000, dtype: bool

In [55]:
# Добавление новой колонки в датафрейм
frame['isAlone'] = 0

In [ ]:
# Можно заметить, что у всех строк значение в isAlone = 0
frame

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,isAlone
0,1310,1,1,"Name1310, Miss. Surname1310",female,29.0,0,0,SOTON/O2 3101272,76.760165,C,0
1,1311,0,3,"Name1311, Col. Surname1311",male,29.0,0,0,223596,10.193097,S,0
2,1312,0,3,"Name1312, Mr. Surname1312",male,20.0,0,0,54636,12.029416,C,0
3,1313,0,3,"Name1313, Mr. Surname1313",male,27.0,0,0,PC 17760,13.429448,S,0
4,1314,0,3,"Name1314, Mr. Surname1314",male,32.0,0,0,364512,4.840769,C,0
...,...,...,...,...,...,...,...,...,...,...,...,...
999995,1001305,0,2,"Name1001305, Mr. Surname1001305",male,27.0,0,0,244358,26.196512,S,0
999996,1001306,1,1,"Name1001306, Miss. Surname1001306",female,33.0,0,0,349221,102.555248,S,0
999997,1001307,0,3,"Name1001307, Mr. Surname1001307",male,29.0,1,0,PC 17601,8.274807,S,0
999998,1001308,0,2,"Name1001308, Mr. Surname1001308",male,35.0,1,0,112050,0.000000,S,0
999999,1001309,1,1,"Name1001309, Miss. Surname1001309",female,37.0,1,0,28403,57.720316,S,0

In [54]:
# Также можно установить новое значение для колонки следующим образом:
frame['isAlone'] = frame['Parch'].apply(lambda x: 1 if x else 0)

In [59]:
frame[frame.isAlone == 1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,isAlone
7,1317,1,2,"Name1317, Miss. Surname1317",female,28.0,0,1,113781,27.950048,S,1
17,1327,1,2,"Name1327, Master. Surname1327",female,4.0,0,2,A/5. 10482,26.712402,S,1
19,1329,0,3,"Name1329, Mr. Surname1329",male,29.0,1,1,315082,20.566141,S,1
21,1331,0,3,"Name1331, Mr. Surname1331",male,13.0,3,1,28665,26.449168,S,1
23,1333,0,3,"Name1333, Mr. Surname1333",male,0.0,4,1,347082,34.939790,Q,1
...,...,...,...,...,...,...,...,...,...,...,...,...
999975,1001285,1,1,"Name1001285, Miss. Surname1001285",female,13.0,1,2,349214,167.748075,S,1
999981,1001291,1,1,"Name1001291, Miss. Surname1001291",female,24.0,0,2,111369,127.652940,S,1
999983,1001293,1,3,"Name1001293, Miss. Surname1001293",female,26.0,0,2,STON/O 2. 3101289,16.019468,C,1
999986,1001296,0,3,"Name1001296, Miss. Surname1001296",female,36.0,1,6,365226,35.706551,C,1
999990,1001300,1,3,"Name1001300, Master. Surname1001300",female,7.0,1,1,330931,2.725446,S,1

In [12]:
# Уникальные значения в колонке
print(frame['Survived'].unique(), frame['Survived'].nunique() )

[1 0] 2

In [13]:
# Можно определить уникальные значения для ка
print("Survived:", frame['Survived'].unique())
print("Pclass:", frame['Pclass'].unique())
print("Sex:", frame['Sex'].unique())
print("SibSp:", frame['SibSp'].unique())
print("Parch:", frame['Parch'].unique())
print("Cabin:", frame['Cabin'].unique())
print("Embarked:", frame['Embarked'].unique())

Survived: [1 0]
Pclass: [1 3 2]
Sex: <StringArray>
['female', 'male']
Length: 2, dtype: str
SibSp: [0 1 3 4 2 8 5]
Parch: [0 1 2 5 3 6 4]
Cabin: <StringArray>
[          nan,         'C83',         'E33',         'E25',         'B22',
         'B79',        'C104', 'C23 C25 C27',         'E77',          'F4',
 ...
        'B102',         'E67',         'E10',         'A36',         'D30',
         'C90',         'E49',         'E68',         'A34',          'D6']
Length: 148, dtype: str
Embarked: <StringArray>
['C', 'S', 'Q', nan]
Length: 4, dtype: str

In [14]:
# Удалить колонку из датафрейма
frame.drop(columns=['Cabin'], inplace=True)

In [15]:
# Можно заметить, что колонки 'Cabin' больше нет
frame.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1310,1,1,"Name1310, Miss. Surname1310",female,NaN,0,0,SOTON/O2 3101272,76.760165,C
1,1311,0,3,"Name1311, Col. Surname1311",male,29.0,0,0,223596,10.193097,S
2,1312,0,3,"Name1312, Mr. Surname1312",male,20.0,0,0,54636,12.029416,C
3,1313,0,3,"Name1313, Mr. Surname1313",male,27.0,0,0,PC 17760,13.429448,S
4,1314,0,3,"Name1314, Mr. Surname1314",male,32.0,0,0,364512,4.840769,C

In [19]:
# Можно заменить пропуски на определенное значение
frame['Age'] = frame['Age'].fillna(frame['Age'].median(), inplace=True)

C:\Users\2003s\AppData\Local\Temp\ipykernel_11560\917634184.py:2: ChainedAssignmentError: A value is being set on a copy of a DataFrame or Series through chained assignment using an inplace method.
Such inplace method never works to update the original DataFrame or Series, because the intermediate object on which we are setting values always behaves as a copy (due to Copy-on-Write).

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' instead, to perform the operation inplace on the original object, or try to avoid an inplace operation using 'df[col] = df[col].method(value)'.

See the documentation for a more detailed explanation: https://pandas.pydata.org/pandas-docs/stable/user_guide/copy_on_write.html
  frame['Age'] = frame['Age'].fillna(frame['Age'].median(), inplace=True)

In [20]:
frame.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1310,1,1,"Name1310, Miss. Surname1310",female,29.0,0,0,SOTON/O2 3101272,76.760165,C
1,1311,0,3,"Name1311, Col. Surname1311",male,29.0,0,0,223596,10.193097,S
2,1312,0,3,"Name1312, Mr. Surname1312",male,20.0,0,0,54636,12.029416,C
3,1313,0,3,"Name1313, Mr. Surname1313",male,27.0,0,0,PC 17760,13.429448,S
4,1314,0,3,"Name1314, Mr. Surname1314",male,32.0,0,0,364512,4.840769,C

In [21]:
# Изменить тип данных у столбца
frame['Age'] = frame['Age'].astype("float64")

In [22]:
# Получить описательные статистики для числовых признаков
frame.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,1.000000e+06,1000000.000000,1000000.00000,1000000.000000,1000000.000000,1000000.000000,1000000.000000
mean,5.013095e+05,0.381681,2.31125,29.224664,0.511101,0.360037,33.461097
std,2.886753e+05,0.485799,0.83577,11.409972,1.104846,0.767296,47.976641
min,1.310000e+03,0.000000,1.00000,0.000000,0.000000,0.000000,0.000000
25%,2.513098e+05,0.000000,2.00000,24.000000,0.000000,0.000000,8.568924
50%,5.013095e+05,0.000000,3.00000,29.000000,0.000000,0.000000,15.883647
75%,7.513092e+05,1.000000,3.00000,35.000000,1.000000,0.000000,35.561000
max,1.001309e+06,1.000000,3.00000,114.000000,8.000000,6.000000,640.883614

In [62]:
# Описательные статистики по столбцу (вернет pandas.Series)
frame.Age.describe()

count    1000000.000000
mean          29.224664
std           11.409972
min            0.000000
25%           24.000000
50%           29.000000
75%           35.000000
max          114.000000
Name: Age, dtype: float64

In [ ]:
# Подсчитать, сколько строк в датафрейме с какими значениями, по конкретному столбцу
# (т.е. можно заметить, что в df 618319 со значением 0 в столбце "Survived" и 381681 со значением 1)
frame.Survived.value_counts()

Survived
0    618319
1    381681
Name: count, dtype: int64

In [ ]:
# Можно получить dataframe как многомерный массив numpy
frame.values

# (также можно получить конкретный столбец - frame.Age.values)

array([[1310, 1, 1, ..., 76.76016504643573, 'C', 0],
       [1311, 0, 3, ..., 10.193096706320182, 'S', 0],
       [1312, 0, 3, ..., 12.02941641147422, 'C', 0],
       ...,
       [1001307, 0, 3, ..., 8.274807141841151, 'S', 0],
       [1001308, 0, 2, ..., 0.0, 'S', 0],
       [1001309, 1, 1, ..., 57.72031596186326, 'S', 0]],
      shape=(1000000, 12), dtype=object)

## Группировка и агрегация

`.groupby()` позволяет осуществлять группировку в рамках столбца (или нескольких столбцов)

In [ ]:
# Посчитать сколько пассажиров было какого возраста 
# Группируем по полю Age
# PassengerId - уникальное значение для каждой строки, следовательно будем считать их
frame.groupby('Age')["PassengerId"].count()

Age
0.0      14031
1.0       2468
2.0       2875
3.0       3225
4.0       3768
         ...
97.0         3
98.0         4
100.0        1
101.0        2
114.0        1
Name: PassengerId, Length: 102, dtype: int64

In [ ]:
# Можно убедиться, что строк с возврастом 0 ровно столько, сколько получилось при группировке
frame[frame.Age == 0.0]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,isAlone
5,1315,1,3,"Name1315, Master. Surname1315",female,0.0,0,0,29750,14.805817,S,0
23,1333,0,3,"Name1333, Mr. Surname1333",male,0.0,4,1,347082,34.939790,Q,1
47,1357,1,3,"Name1357, Master. Surname1357",female,0.0,2,1,364511,18.502999,C,1
77,1387,0,3,"Name1387, Master. Surname1387",male,0.0,4,2,223596,9.187959,S,1
242,1552,1,2,"Name1552, Master. Surname1552",female,0.0,1,1,349209,30.340712,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...
999627,1000937,1,3,"Name1000937, Master. Surname1000937",female,0.0,0,2,2683,16.358591,S,1
999772,1001082,0,3,"Name1001082, Mr. Surname1001082",male,0.0,5,2,110813,55.126773,S,1
999814,1001124,1,2,"Name1001124, Mr. Surname1001124",male,0.0,1,1,35273,10.115557,S,1
999889,1001199,1,2,"Name1001199, Mr. Surname1001199",male,0.0,1,1,350043,20.761382,S,1
999937,1001247,1,2,"Name1001247, Master. Surname1001247",female,0.0,2,1,3101295,12.685898,S,1

In [ ]:
# Можно использовать метод у результата группировки agg(), перечислив функции, которые хотим определить

# count - кол-во объектов
# min - минимальное значение в группе
# max - максимальное значение в группе

frame.groupby("Pclass").Age.agg(['count', 'max', 'min'])

         count    max  min
Pclass
1       242069  114.0  0.0
2       204612   94.0  0.0
3       553319   83.0  0.0

In [55]:
# Когда группируем сразу по нескольким столбцам, получается Multi-Index
# С которым сложно будет работать 
group_res_one = frame.groupby(["Pclass", "isAlone"]).Fare.agg(['count', 'max', 'min'])
print(group_res_one.index)
group_res_one

MultiIndex([(1, 0),
            (1, 1),
            (2, 0),
            (2, 1),
            (3, 0),
            (3, 1)],
           names=['Pclass', 'isAlone'])

                 count         max  min
Pclass isAlone
1      0        183305  640.251900  0.0
       1         58764  640.883614  0.0
2      0        150796   96.115837  0.0
       1         53816   89.164979  0.0
3      0        433688  360.493366  0.0
       1        119631  251.437589  0.0

In [56]:
# Позволяет сделать reset для индексов
group_res_one = group_res_one.reset_index()
print(group_res_one.index)
group_res_one

RangeIndex(start=0, stop=6, step=1)

   Pclass  isAlone   count         max  min
0       1        0  183305  640.251900  0.0
1       1        1   58764  640.883614  0.0
2       2        0  150796   96.115837  0.0
3       2        1   53816   89.164979  0.0
4       3        0  433688  360.493366  0.0
5       3        1  119631  251.437589  0.0

In [59]:
# Можно выполнять агрегацию сразу по нескольким столбцам

# Пример: в рамках каждого класса, определить средний возраст, максимальную цену билета
frame.groupby('Pclass').agg({
    "Age":'mean',
    "Fare":"max"
})

              Age        Fare
Pclass
1       36.411571  640.883614
2       29.419917   96.115837
3       26.113817  360.493366

In [60]:
# Если хотим определить еще какое-то значение, то указываем как массив строк

# Пример: В рамках класса определить средний возраст, максимальный возраст в каждой группе
# максимальную цену билета
frame.groupby('Pclass').agg({
    "Age":['mean', 'max'],
    "Fare":"max"
})

              Age               Fare
             mean    max         max
Pclass
1       36.411571  114.0  640.883614
2       29.419917   94.0   96.115837
3       26.113817   83.0  360.493366

In [61]:
# Тоже самое можно сделат если происходит агрегация по нескольким столбцам
frame.groupby(['Pclass', 'isAlone']).agg({
    "Age":['mean', 'max'],
    "Fare":"max"
})

                      Age               Fare
                     mean    max         max
Pclass isAlone
1      0        37.227120  100.0  640.251900
       1        33.864565  114.0  640.883614
2      0        31.932243   94.0   96.115837
       1        22.377012   89.0   89.164979
3      0        28.019879   74.0  360.493366
       1        19.218148   83.0  251.437589

In [63]:
# Можно задать свои имена для колонок, для удобства
new_agg_frame = frame.groupby(['Pclass', 'isAlone']).agg(
    mean_age=('Age', 'mean'),
    max_age=('Age', 'max'),
    max_fare=("Fare", "max")
)
new_agg_frame

                 mean_age  max_age    max_fare
Pclass isAlone
1      0        37.227120    100.0  640.251900
       1        33.864565    114.0  640.883614
2      0        31.932243     94.0   96.115837
       1        22.377012     89.0   89.164979
3      0        28.019879     74.0  360.493366
       1        19.218148     83.0  251.437589

### Сортировка

In [ ]:
# Отсортировать датафрейм по определенному полю (вернет новый датафрейм, исходный останется без изменения)
frame.sort_values(by='Age')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,isAlone
559736,561046,1,2,"Name561046, Master. Surname561046",male,0.0,1,1,2666,9.216463,S,1
559883,561193,0,3,"Name561193, Mr. Surname561193",male,0.0,5,2,382652,42.298772,S,1
673989,675299,1,2,"Name675299, Master. Surname675299",female,0.0,0,2,9234,21.095964,S,1
202797,204107,1,3,"Name204107, Mr. Surname204107",male,0.0,1,1,348121,9.460591,S,1
23,1333,0,3,"Name1333, Mr. Surname1333",male,0.0,4,1,347082,34.939790,Q,1
...,...,...,...,...,...,...,...,...,...,...,...,...
947208,948518,0,1,"Name948518, Mr. Surname948518",male,98.0,1,1,364849,57.915866,S,1
163371,164681,0,1,"Name164681, Mr. Surname164681",male,100.0,0,0,PC 17475,21.677091,S,0
323725,325035,0,1,"Name325035, Mr. Surname325035",male,101.0,1,1,36963,182.444509,C,1
652169,653479,0,1,"Name653479, Mr. Surname653479",male,101.0,1,1,315097,118.694265,S,1
278398,279708,0,1,"Name279708, Mr. Surname279708",male,114.0,1,1,2691,12.426720,S,1

In [ ]:
# Сортировать можно по нескольким столбцам
# Например, по возрасту и по цене (сначала по возрасту, в рамках каждой возрастной категории - по цене билета)
frame.sort_values(by=['Age', "Fare"], ascending=True) # ascending=True - возрастание | ascending=False - убывание

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,isAlone
809,2119,0,3,"Name2119, Master. Surname2119",female,0.0,1,0,365222,0.000000,S,0
1126,2436,1,3,"Name2436, Master. Surname2436",female,0.0,1,1,35273,0.000000,S,1
3401,4711,1,3,"Name4711, Mr. Surname4711",male,0.0,1,1,330959,0.000000,S,1
4484,5794,0,3,"Name5794, Master. Surname5794",male,0.0,0,0,244367,0.000000,S,0
6270,7580,0,2,"Name7580, Mr. Surname7580",male,0.0,0,0,370377,0.000000,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
837560,838870,0,1,"Name838870, Mr. Surname838870",male,98.0,1,4,4135,113.401426,S,1
163371,164681,0,1,"Name164681, Mr. Surname164681",male,100.0,0,0,PC 17475,21.677091,S,0
652169,653479,0,1,"Name653479, Mr. Surname653479",male,101.0,1,1,315097,118.694265,S,1
323725,325035,0,1,"Name325035, Mr. Surname325035",male,101.0,1,1,36963,182.444509,C,1
278398,279708,0,1,"Name279708, Mr. Surname279708",male,114.0,1,1,2691,12.426720,S,1

## Способы создания DataFrame

In [13]:
# Создать из списка словарей
df = pd.DataFrame(
    data=[
        {"size":20, "color":'red', 'isDark': False},
        {"size":40, "color":'red', 'isDark': False},
        {"size":31, "color":'red', 'isDark': False},
        {"size":22, "color":'green', 'isDark': True},
        {"size":33, "color":'blue', 'isDark': False},
        {"size":29, "color":'red', 'isDark': True}
    ],
    index=[10,11,20,30,40,50] # индексы можно не указывать (по default начинает с 0)
)

df

    age  color  isDark
10   20    red   False
1    40    red   False
2    31    red   False
3    22  green    True
4    33   blue   False
5    29    red    True

In [12]:
# Из словаря, значения в котором представлены списком
df1 = pd.DataFrame({
    'size':[20, 30, 32, 40],
    'color':['black', 'white', 'orange', 'yellow'],
    'isDark':[True, False, False, False],
})

df1

   age   color  isDark
0   20   black    True
1   30   white   False
2   32  orange   False
3   40  yellow   False

In [15]:
# Из двумерного массива
df2 = pd.DataFrame(
    data=[
        [20, 'black', True],
        [22, 'white', True],
        [23, 'black', False]
    ],
    columns=['size', 'color', 'isDark']
)

df2

   age  color  isDark
0   20  black    True
1   22  white    True
2   23  black   False

## Соединение нескольких фреймов

In [30]:
# Предположим, что нужно соединить 2 DataFrame

df_one = pd.DataFrame({
    'id':[0, 1, 2, 3, 4],
    'prod':['A', "B", "C", "D", "E"],
    'price':[101, 102.3, 32, 403.2, 345.5]
})
print(df_one)

df_two = pd.DataFrame({
    'id': [4, 2, 3, 1, 0, 5],
    "last_price": [405.5, 52, 370.2, 132.3, 111, 99]
})
print("=====")
print(df_two)

   id prod  price
0   0    A  101.0
1   1    B  102.3
2   2    C   32.0
3   3    D  403.2
4   4    E  345.5
=====
   id  last_price
0   4       405.5
1   2        52.0
2   3       370.2
3   1       132.3
4   0       111.0
5   5        99.0

In [44]:
# Можно соединить по общему столбцу (Похоже на соединение таблиц в SQL)
# on='id' - по какому полю
# how='inner' - как соединять
df_3_merge = pd.merge(df_one, df_two, on='id', how='inner')

# (можно заметить, что столбцы объединились по полю 'id', к фрейму df_one, был добавлен df_two по полю 'id')
df_3_merge

# Вместо how='inner' можно использовать how='left', how='right', результат будет изменять

   id prod  price  last_price
0   0    A  101.0       111.0
1   1    B  102.3       132.3
2   2    C   32.0        52.0
3   3    D  403.2       370.2
4   4    E  345.5       405.5

In [46]:
# Аналог
df_one.merge(df_two, on='id', how='right')

   id prod  price  last_price
0   4    E  345.5       405.5
1   2    C   32.0        52.0
2   3    D  403.2       370.2
3   1    B  102.3       132.3
4   0    A  101.0       111.0
5   5  NaN    NaN        99.0

In [32]:
# Можно сделать конкатенацию фреймов
# axis=0 - добавляет строчки
# axis=1 - добавляет столбцы
# ignore_index=True - игнорировать ли исходные индексы в датафреймах

pd.concat([df_one, df_two], axis=0, ignore_index=True)

    id prod  price  last_price
0    0    A  101.0         NaN
1    1    B  102.3         NaN
2    2    C   32.0         NaN
3    3    D  403.2         NaN
4    4    E  345.5         NaN
5    4  NaN    NaN       405.5
6    2  NaN    NaN        52.0
7    3  NaN    NaN       370.2
8    1  NaN    NaN       132.3
9    0  NaN    NaN       111.0
10   5  NaN    NaN        99.0

In [33]:
# Можно заметить разный порядок столбцов
pd.concat([df_one, df_two], axis=1, ignore_index=False)

    id prod  price  id  last_price
0  0.0    A  101.0   4       405.5
1  1.0    B  102.3   2        52.0
2  2.0    C   32.0   3       370.2
3  3.0    D  403.2   1       132.3
4  4.0    E  345.5   0       111.0
5  NaN  NaN    NaN   5        99.0

## Оконные функции 
will be later ...

## Работа с пропусками | Преобразования

In [73]:
# Определить сколько пропусков в конкретном столбце
print(frame['Age'].isna().sum())

# или
frame.isna().sum()

198600

PassengerId         0
Survived            0
Pclass              0
Name                0
Sex                 0
Age            198600
SibSp               0
Parch               0
Ticket              0
Fare                0
Cabin          770195
Embarked         2240
isAlone             0
dtype: int64

In [79]:
# Заполнить пропуски конкретным занчением
frame['Age'] = frame['Age'].fillna(frame['Age'].median())

print(frame['Age'].isna().sum())

0